IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/LIN4_LIN4.xml
<module name="LIN4_LIN" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="LIN4_SCIGCR0" acronym="LIN4_SCIGCR0" offset="0x0" width="32" description="The SCIGCR0 register defines the module reset.">
		<bitfield id="RESET" width="1" begin="0" end="0" resetval="0x0" description="This bit resets the SCI/LIN module. This bit is effective in LIN or SCI-compatible mode.. This bit affects the reset state of the SCI/LIN module." range="0" rwaccess="R/W"/>
	</register>
	<register id="LIN4_SCIGCR1" acronym="LIN4_SCIGCR1" offset="0x4" width="32" description="The SCIGCR1 register defines the frame format, protocol, and communication mode used by the SCI.">
		<bitfield id="TXENA" width="1" begin="25" end="25" resetval="0x0" description="Transmit enable.This bit is effective in LIN and SCI modes. Data is transferred from SCITD or the TDy [with y=0, 1,...7] buffers in LIN mode to the SCITXSHF shift out register only when the TXENA bit is set. Note: Data written to SCITD or the transmit multi-buffer before TXENA is set is nottransmitted. If TXENA is cleared while transmission is ongoing, the data previouslywritten to SCITD is sent [including the checksum byte in LIN mode]." range="25" rwaccess="R/W"/> 
		<bitfield id="RXENA" width="1" begin="24" end="24" resetval="0x0" description="Receive enable.This bit is effective in LIN or SCI-compatible mode. RXENA allows or prevents the transfer of data from SCIRXSHF to SCIRD or the receive multibuffers. Note: Clearing RXENA stops received characters from being transferred into the receive buffer or multi-buffers, prevents the RX status flags [see Table 7] from being updated by receive data, and inhibits both receive and error interrupts. However, the shift register continues to assemble data regardless of the state of RXENA. Note: If RXENA is cleared before the time the reception of a frame is complete, the data from the frame is not transferred into the receive buffer. Note: If RXENA is set before the time the reception of a frame is complete, the data from the frame is transferred into the receive buffer. If RXENA is set while SCIRXSHF is in the process of assembling a frame, the status flags are not guaranteed to be accurate for that frame. To ensure that the status flags correctly reflect what was detected on the bus during a particular frame, RXENA should be set before the detection of that frame" range="24" rwaccess="R/W"/> 
		<bitfield id="CONT" width="1" begin="17" end="17" resetval="0x0" description="Continue on suspend.This bit has an effect only when a program is being debugged with an emulator, and it determines how the SCI/LIN operates when the program is suspended. This bit affects the LIN counters. When this bit is set, the counters are not stopped during debug. When this bit is cleared, the counters are stopped during debug." range="17" rwaccess="R/W"/> 
		<bitfield id="LOOPBACK" width="1" begin="16" end="16" resetval="0x0" description="Loopback bit.This bit is effective in LIN or SCI-compatible mode. The self-checking option for the SCI/LIN can be selected with this bit. If the LINTX and LINRX pins are configured with SCI/LIN functionality, then the LINTX pin is internally connected to the LINRX pin. Externally, during loop back operation, the LINTX pin outputs a high value and the LINRX pin is in a high-impedance state. If this bit value is changed while the SCI/LIN is transmitting or receiving data, errors may result." range="16" rwaccess="R/W"/> 
		<bitfield id="STOPEXTFRAME" width="1" begin="13" end="13" resetval="0x0" description="Stop extended frame communication.This bit is effective in LIN mode only. This bit can be written only during extended frame communication. When the extended frame communication is stopped, this bit is cleared automatically." range="13" rwaccess="R/W"/> 
		<bitfield id="HGENCTRL" width="1" begin="12" end="12" resetval="0x0" description="HGEN control bit.This bit is effective in LIN mode only. This bit controls the type of mask filtering comparison." range="12" rwaccess="R/W"/> 
		<bitfield id="CTYPE" width="1" begin="11" end="11" resetval="0x0" description="Checksum type.This bit is effective in LIN mode only. This bit controls the type of checksum to be used: classic or enhanced." range="11" rwaccess="R/W"/> 
		<bitfield id="MBUFMODE" width="1" begin="10" end="10" resetval="0x0" description="Multibuffer mode.This bit is effective in LIN or SCI-compatible mode. This bit controls receive/transmit buffer usage, that is, whether the RX/TX multibuffers are used or a single register, RD0/TD0, is used." range="10" rwaccess="R/W"/> 
		<bitfield id="ADAPT" width="1" begin="9" end="9" resetval="0x0" description="Adapt mode enable.This mode is effective in LIN mode only. This bit has an effect during the detection of the Sync Field. There are two LIN protocol bit rate modes that could be enabled with this bit according to the Node capability file definition: automatic or select. Software and network configuration will decide which of the previous two modes. When this bit is cleared, the LIN 2.0 protocol fixed bit rate should be used. If the ADAPT bit is set, a LIN slave node detecting the baudrate will compare it to the prescalers in BRSR register and update it if they are different. The BRSR register will be updated  with the new value. If this bit is not set there will be no adjustment to the BRSR register. This field is writable in LIN mode only." range="9" rwaccess="R/W"/> 
		<bitfield id="SLEEP" width="1" begin="8" end="8" resetval="0x0" description="SCI sleep.SCI compatibility mode only. In a multiprocessor configuration, this bit controls the receive sleep function. Clearing this bit brings the SCI out of sleep mode. The receiver still operates when the SLEEP bit is set; however, RXRDY is updated and SCIRD is loaded with new data only when an address frame is detected. The remaining receiver status flags are updated and an error interrupt is requested if the corresponding interrupt enable bit is set, regardless of the value of the SLEEP bit. In this way, if an error is detected on the receive data line while the SCI is asleep, software can promptly deal with the error condition. The SLEEP bit is not automatically cleared when an address byte is detected. This field is writable in SCI mode only." range="8" rwaccess="R/W"/> 
		<bitfield id="SWNRST" width="1" begin="7" end="7" resetval="0x0" description="Software reset [active low].This bit is effective in LIN or SCI-compatible mode. The SCI/LIN should only be configured while SWnRST = 0. Only the following configuration bits can be changed in runtime [i.e.,while SWnRESET = 1]:- STOP EXT Frame [SCIGCR1[13]]- CC bit [SCIGCR2[17]]- SC bit [SCIGCR2[16]]" range="7" rwaccess="R/W"/> 
		<bitfield id="LINMODE" width="1" begin="6" end="6" resetval="0x0" description="LIN modeThis bit controls the mode of operation of the module. " range="6" rwaccess="R/W"/> 
		<bitfield id="CLK_MASTER" width="1" begin="5" end="5" resetval="0x0" description="SCI internal clock enable or LIN Master/Slave configuration.In the SCI mode, this bit enables the clock to the SCI module. In LIN mode, this bit determines whether a LIN node is a slave or master." range="5" rwaccess="R/W"/> 
		<bitfield id="STOP" width="1" begin="4" end="4" resetval="0x0" description="SCI number of stop bits.This bit is effective in SCI-compatible mode only. Note: The receiver checks for only one stop bit. However in idle-line mode, the receiver waits until the end of the second stop bit [if STOP = 1] to begin checking for an idle period. This field is writable in SCI mode only." range="4" rwaccess="R/W"/> 
		<bitfield id="PARITY" width="1" begin="3" end="3" resetval="0x0" description="SCI parity odd/even selection.This bit is effective in SCI-compatible mode only. If the PARITY ENA bit [SCIGCR1.2] is set, PARITY designates odd or even parity. The parity bit is calculated based on the data bits in each frame and the address bit [in address-bit mode]. The start and stop fields in the frame are not included in the parity calculation. This field is writable in SCI mode only." range="3" rwaccess="R/W"/> 
		<bitfield id="PARITYENA" width="1" begin="2" end="2" resetval="0x0" description="Parity enable.Enables or disables the parity function." range="2" rwaccess="R/W"/> 
		<bitfield id="TIMINGMODE" width="1" begin="1" end="1" resetval="0x0" description="SCI timing mode bit.This bit is effective in SCI-compatible mode only. It must be set to 1 when the SCI mode is used. This bit configures the SCI for asynchronous operation." range="1" rwaccess="R/W"/> 
		<bitfield id="COMMMODE" width="1" begin="0" end="0" resetval="0x0" description="SCI/LIN communication mode bit.In compatibility mode, it selects the SCI communication mode. In LIN mode it selects length control option for ID-field bits ID4 and ID5." range="0" rwaccess="R/W"/>
	</register>
	<register id="LIN4_SCIGCR2" acronym="LIN4_SCIGCR2" offset="0x8" width="32" description="The SCIGCR2 register is used to send or compare a checksum byte during extended frames, to generate a wakeup and for low-power mode control of the LIN module.">
		<bitfield id="CC" width="1" begin="17" end="17" resetval="0x0" description="Compare Checksum.This mode is effective in LIN mode only. This bit is used by the receiver for extended frames to trigger a checksum compare. The user will initiate this transaction by writing a one to this bit.In non multibuffer mode, once the CC bit is set, the checksum will be compared on the byte that is currently being received, expected to be the checkbyte.During Multi-buffer mode, following are the scenarios associated with the CC bit :-  If CC bit is set during the reception of the data, then the byte that is received after the reception of the programmed no. of data bytes indicated by SCIFORMAT[18:16], is treated as a checksum byte.- If CC bit is set during the IDLE period [i.e. during inter-frame space], then the next immediate byte will be treated as a checksum byte. A CE will immediatly be flagged if there is a checksum error. This bit is automatically cleared once the checksum is successfully compared." range="17" rwaccess="R/W"/> 
		<bitfield id="SC" width="1" begin="16" end="16" resetval="0x0" description="Send ChecksumThis mode is effective in LIN mode only. This bit is used by the transmitter with extended frames to send a checkbyte. In non multibuffer mode the checkbyte will be sent after the current byte transmission. In multibuffer mode the checkbyte will be sent after the last byte count, indicated by the SCIFORMAT[18:16]].   This field is writable in LIN mode only." range="16" rwaccess="R/W"/> 
		<bitfield id="GENWU" width="1" begin="8" end="8" resetval="0x0" description="Generate wakeup signal.This bit controls the generation of a wakeup signal, by transmitting the TDO buffer value. This bit is cleared on reception of a valid sync break." range="8" rwaccess="R/W"/> 
		<bitfield id="POWERDOWN" width="1" begin="0" end="0" resetval="0x0" description="Power down.This bit is effective in LIN or SCI-compatible mode. When the powerdown bit is set, the SCI/LIN module attempts to enter local low-power mode. If the POWERDOWN bit is set while the receiver is actively receiving data and the wakeup interrupt is disabled, then the SCI/LIN will delay low-power mode from being entered until completion of reception. In LIN mode the user may set the POWERDOWN bit on Sleep Command reception or on idle bus detection [more than 4 seconds, i.e. 80,000 cycles at 20kHz]" range="0" rwaccess="R/W"/>
	</register>
	<register id="LIN4_SCISETINT" acronym="LIN4_SCISETINT" offset="0xC" width="32" description="The SCISETINT register is used to enable the various interrupts available in the LIN module.">
		<bitfield id="SETBEINT" width="1" begin="31" end="31" resetval="0x0" description="Set bit error interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN module to generate an interrupt when there is a bit error. This field is writable in LIN mode only." range="31" rwaccess="R/W1TS"/> 
		<bitfield id="SETPBEINT" width="1" begin="30" end="30" resetval="0x0" description="Set physical bus error interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN module to generate an interrupt when a physical bus error occurs. This field is writable in LIN mode only." range="30" rwaccess="R/W1TS"/> 
		<bitfield id="SETCEINT" width="1" begin="29" end="29" resetval="0x0" description="Set checksum-error Interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN module to generate an interrupt when there is a checksum error. This field is writable in LIN mode only." range="29" rwaccess="R/W1TS"/> 
		<bitfield id="SETISFEINT" width="1" begin="28" end="28" resetval="0x0" description="Set inconsistent-sync-field-error interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN module to generate an interrupt when there is an inconsistent sync field error. This field is writable in LIN mode only." range="28" rwaccess="R/W1TS"/> 
		<bitfield id="SETNREINT" width="1" begin="27" end="27" resetval="0x0" description="Set no-response-error interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN module to generate an interrupt when a no-response error occurs. This field is writable in LIN mode only." range="27" rwaccess="R/W1TS"/> 
		<bitfield id="SETFEINT" width="1" begin="26" end="26" resetval="0x0" description="Set framing-error interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit enables the SCI/LIN module to generate an interrupt when a framing error occurs." range="26" rwaccess="R/W1TS"/> 
		<bitfield id="SETOEINT" width="1" begin="25" end="25" resetval="0x0" description="Set overrun-error interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit enables the SCI/LIN module to generate an interrupt when an overrun error occurs." range="25" rwaccess="R/W1TS"/> 
		<bitfield id="SETPEINT" width="1" begin="24" end="24" resetval="0x0" description="Set parity interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit enables the SCI/LIN module to generate an interrupt when a parity error occurs." range="24" rwaccess="R/W1TS"/> 
		<bitfield id="SET_RX_DMA_ALL" width="1" begin="18" end="18" resetval="0x0" description="Set receiver DMA for Address &#38; Data frames.This bit is effective in LIN or SCI-compatible mode. To enable RX DMA request for address and data frames this bit must be set. If it is cleared, RX interrupt request is generated for address frames and DMA requests are generated for data frames. " range="18" rwaccess="R/W1TS"/> 
		<bitfield id="SET_RX_DMA" width="1" begin="17" end="17" resetval="0x0" description="Set receiver DMA.This bit is effective in LIN or SCI-compatible mode. To enable DMA requests for the receiver this bit must be set. If it is cleared, interrupt requests are generated depending on SETRXINT." range="17" rwaccess="R/W1TS"/> 
		<bitfield id="SET_TX_DMA" width="1" begin="16" end="16" resetval="0x0" description="Set transmit DMA.This bit is effective in LIN or SCI-compatible mode. To enable DMA requests for the transmitter, this bit must be set. If it is cleared, interrupt requests are generated depending on SETTXINT." range="16" rwaccess="R/W1TS"/> 
		<bitfield id="SETIDINT" width="1" begin="13" end="13" resetval="0x0" description="Set Identification interrupt.This bit is effective in LIN mode only. This bit is set to enable interrupt once a valid matching identifier is received." range="13" rwaccess="R/W1TS"/> 
		<bitfield id="SETRXINT" width="1" begin="9" end="9" resetval="0x0" description="Set Receiver interrupt.Setting this bit enables the SCI/LIN to generate a receive interrupt after a frame has been completely received and the data is being transferred from SCIRXSHF to SCIRD." range="9" rwaccess="R/W1TS"/> 
		<bitfield id="SETTXINT" width="1" begin="8" end="8" resetval="0x0" description="Set Transmitter interrupt.Setting this bit enables the SCI/LIN to generate a transmit interrupt as data is being transferred from SCITD to SCITXSHF and the TXRDY bit is being set." range="8" rwaccess="R/W1TS"/> 
		<bitfield id="SETTOA3WUSINT" width="1" begin="7" end="7" resetval="0x0" description="Set Timeout After 3 Wakeup Signals interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN to generate an interrupt when there is a timeout after 3 wakeup signals have been sent. This field is writable in LIN mode only." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="SETTOAWUSINT" width="1" begin="6" end="6" resetval="0x0" description="Set Timeout After Wakeup Signal interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN to generate an interrupt when there is a timeout after one wakeup signal has been sent. This field is writable in LIN mode only." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="SETTIMEOUTINT" width="1" begin="4" end="4" resetval="0x0" description="Set timeout interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN to generate an interrupt when no LIN bus activity [bus idle] occurs for at least 4 seconds. This field is writable in LIN mode only." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="SETWAKEUPINT" width="1" begin="1" end="1" resetval="0x0" description="Set wake-up interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit enables the SCI/LIN to generate a wake-up interrupt and thereby exit low-power mode. The wake-up interrupt is asserted on falling edge of the wake-up pulse. If enabled, the wake-up interrupt is asserted when local low-power mode is requested while the receiver is busy or if a low level is detected on the SCIRX pin during low-power mode. Wake-up interrupt is not asserted upon a wakeup pulse if the module is not in power down mode." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="SETBRKDTINT" width="1" begin="0" end="0" resetval="0x0" description="Set break-detect interrupt.This bit is effective in SCI-compatible mode only. Setting this bit enables the SCI/LIN to generate an interrupt if a break condition is detected on the LINRX pin. This field is writable in SCI mode only." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="LIN4_SCICLEARINT" acronym="LIN4_SCICLEARINT" offset="0x10" width="32" description="The SCICLEARINT register is used to disable the enabled interrupts without accessing the SCISETINT register.">
		<bitfield id="CLRBEINT" width="1" begin="31" end="31" resetval="0x0" description="Clear Bit Error Interrupt.This bit is effective in LIN mode only. Setting this bit disables the bit error interrupt. This field is writable in LIN mode only." range="31" rwaccess="R/W1TC"/> 
		<bitfield id="CLRPBEINT" width="1" begin="30" end="30" resetval="0x0" description="Clear Physical Bus Error Interrupt.This bit is effective in LIN mode only. Setting this bit disables the physical-bus error interrupt. This field is writable in LIN mode only." range="30" rwaccess="R/W1TC"/> 
		<bitfield id="CLRCEINT" width="1" begin="29" end="29" resetval="0x0" description="Clear checksum-error Interrupt.This bit is effective in LIN mode only. Setting this bit disables the checksum-error interrupt. This field is writable in LIN mode only." range="29" rwaccess="R/W1TC"/> 
		<bitfield id="CLRISFEINT" width="1" begin="28" end="28" resetval="0x0" description="Clear Inconsistent-Sync-Field-Error Interrupt.This bit is effective in LIN mode only. Setting this bit disables the ISFE interrupt. This field is writable in LIN mode only." range="28" rwaccess="R/W1TC"/> 
		<bitfield id="CLRNREINT" width="1" begin="27" end="27" resetval="0x0" description="Clear No-Reponse-Error Interrupt.This bit is effective in LIN mode only. Setting this bit disables the no-response error interrupt. This field is writable in LIN mode only." range="27" rwaccess="R/W1TC"/> 
		<bitfield id="CLRFEINT" width="1" begin="26" end="26" resetval="0x0" description="Clear Framing-Error Interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables framing-error interrupt." range="26" rwaccess="R/W1TC"/> 
		<bitfield id="CLROEINT" width="1" begin="25" end="25" resetval="0x0" description="Clear Overrun-Error Interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the overrun interrupt." range="25" rwaccess="R/W1TC"/> 
		<bitfield id="CLRPEINT" width="1" begin="24" end="24" resetval="0x0" description="Clear Parity Interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the parity error interrupt." range="24" rwaccess="R/W1TC"/> 
		<bitfield id="SETRXDMA" width="1" begin="17" end="17" resetval="0x0" description="Clear receiver DMA.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the receive DMA request." range="17" rwaccess="R/W1TC"/> 
		<bitfield id="CLRTXDMA" width="1" begin="16" end="16" resetval="0x0" description="Clear transmit DMA.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the transmit DMA request." range="16" rwaccess="R/W1TC"/> 
		<bitfield id="CLRIDINT" width="1" begin="13" end="13" resetval="0x0" description="Clear Identifier interrupt.This bit is effective in LIN mode only. Setting this bit disables the ID interrupt." range="13" rwaccess="R/W1TC"/> 
		<bitfield id="CLRRXINT" width="1" begin="9" end="9" resetval="0x0" description="Clear Receiver interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the receiver interrupt." range="9" rwaccess="R/W1TC"/> 
		<bitfield id="CLRTXINT" width="1" begin="8" end="8" resetval="0x0" description="Clear Transmitter interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the transmitter interrupt." range="8" rwaccess="R/W1TC"/> 
		<bitfield id="CLRTOA3WUSINT" width="1" begin="7" end="7" resetval="0x0" description="Clear Timeout After 3 Wakeup Signals interrupt.This bit is effective in LIN mode only. Setting this bit disables the timeout after 3 wakeup signals interrupt. This field is writable in LIN mode only." range="7" rwaccess="R/W1TC"/> 
		<bitfield id="CLRTOAWUSINT" width="1" begin="6" end="6" resetval="0x0" description="Clear Timeout After Wakeup Signal interrupt.This bit is effective in LIN mode only. Setting this bit disables the timeout after one wakeup signal interrupt. This field is writable in LIN mode only." range="6" rwaccess="R/W1TC"/> 
		<bitfield id="CLRTIMEOUTINT" width="1" begin="4" end="4" resetval="0x0" description="Clear Timeout interrupt.This bit is effective in LIN mode only. Setting this bit disables the timeout [LIN bus idle] interrupt. This field is writable in LIN mode only." range="4" rwaccess="R/W1TC"/> 
		<bitfield id="CLRWAKEUPINT" width="1" begin="1" end="1" resetval="0x0" description="Clear Wake-up interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the wake-up interrupt." range="1" rwaccess="R/W1TC"/> 
		<bitfield id="CLRBRKDTINT" width="1" begin="0" end="0" resetval="0x0" description="Clear Break-detect interrupt.This bit is effective in SCI-compatible mode only. Setting this bit disables the Break-detect interrupt. This field is writable in SCI mode only." range="0" rwaccess="R/W1TC"/>
	</register>
