IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/LIN4_LIN4.xml
	<register id="LIN4_SCISETINTLVL" acronym="LIN4_SCISETINTLVL" offset="0x14" width="32" description="The SCISETINTLVL register is used to map individual interrupt sources to the INT1 interrupt line.">
		<bitfield id="SETBEINTLVL" width="1" begin="31" end="31" resetval="0x0" description="Set Bit Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Bit Error interrupt level to the INT1 line. This field is writable in LIN mode only." range="31" rwaccess="R/W1TS"/> 
		<bitfield id="SETPBEINTLVL" width="1" begin="30" end="30" resetval="0x0" description="Set Physical Bus Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Physical Bus Error interrupt level to the INT1 line. This field is writable in LIN mode only." range="30" rwaccess="R/W1TS"/> 
		<bitfield id="SETCEINTLVL" width="1" begin="29" end="29" resetval="0x0" description="Set Checksum-error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Checksum-error interrupt level to the INT1 line. This field is writable in LIN mode only." range="29" rwaccess="R/W1TS"/> 
		<bitfield id="SETISFEINTLVL" width="1" begin="28" end="28" resetval="0x0" description="Set Inconsistent-Sync-Field-Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Inconsistent-Sync-Field-Error interrupt level to the INT1 line. This field is writable in LIN mode only." range="28" rwaccess="R/W1TS"/> 
		<bitfield id="SETNREINTLVL" width="1" begin="27" end="27" resetval="0x0" description="Set No-Reponse-Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the No-Response-Error interrupt level to the INT1 line. This field is writable in LIN mode only." range="27" rwaccess="R/W1TS"/> 
		<bitfield id="SETFEINTLVL" width="1" begin="26" end="26" resetval="0x0" description="Set Framing-Error interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Framing-Error interrupt level to the INT1 line." range="26" rwaccess="R/W1TS"/> 
		<bitfield id="SETOEINTLVL" width="1" begin="25" end="25" resetval="0x0" description="Set Overrun-Error Interrupt Level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Overrun-Error interrupt level to the INT1 line." range="25" rwaccess="R/W1TS"/> 
		<bitfield id="SETPEINTLVL" width="1" begin="24" end="24" resetval="0x0" description="Set Parity Error interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Parity error interrupt level to the INT1 line." range="24" rwaccess="R/W1TS"/> 
		<bitfield id="SETIDINTLVL" width="1" begin="13" end="13" resetval="0x0" description="Set ID interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the ID interrupt level to the INT1 line. This field is writable in LIN mode only." range="13" rwaccess="R/W1TS"/> 
		<bitfield id="SETRXINTOVO" width="1" begin="9" end="9" resetval="0x0" description="Set Receiver interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the receiver interrupt level to the INT1 line." range="9" rwaccess="R/W1TS"/> 
		<bitfield id="SETTXINTLVL" width="1" begin="8" end="8" resetval="0x0" description="Set Transmitter interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the transmitter interrupt level to the INT1 line." range="8" rwaccess="R/W1TS"/> 
		<bitfield id="SETTOA3WUSINTLVL" width="1" begin="7" end="7" resetval="0x0" description="Set Timeout After 3 Wakeup Signals interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the timeout after 3 wakeup signals interrupt level to the INT1 line. This field is writable in LIN mode only." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="SETTOAWUSINTLVL" width="1" begin="6" end="6" resetval="0x0" description="Set Timeout After Wakeup Signal interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the the timeout after wakeup interrupt level to the INT1 line. This field is writable in LIN mode only." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="SETTIMEOUTINTLVL" width="1" begin="4" end="4" resetval="0x0" description="Set Timeout interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the timeout interrupt level to the INT1 line. This field is writable in LIN mode only." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="SETWAKEUPINTLVL" width="1" begin="1" end="1" resetval="0x0" description="Set Wake-up interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Wake-up interrupt level to the INT1 line." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="SETBRKDTINTLVL" width="1" begin="0" end="0" resetval="0x0" description="Set Break-detect interrupt level.This bit is effective in SCI-compatible mode only. Writing to this bit maps the Break-detect interrupt level to the INT1 line. This field is writable in SCI mode only." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="LIN4_SCICLEARINTLVL" acronym="LIN4_SCICLEARINTLVL" offset="0x18" width="32" description="The SCICLEARINTLVL register is used to map individual interrupt sources to the INT0 line.">
		<bitfield id="CLRBEINTLVL" width="1" begin="31" end="31" resetval="0x0" description="Clear Bit Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Bit Error interrupt level to the INT0 line. This field is writable in LIN mode only." range="31" rwaccess="R/W1TC"/> 
		<bitfield id="CLRPBEINTLVL" width="1" begin="30" end="30" resetval="0x0" description="Clear Physical Bus Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Physical Bus Error interrupt level to the INT0 line. This field is writable in LIN mode only." range="30" rwaccess="R/W1TC"/> 
		<bitfield id="CLRCEINTLVL" width="1" begin="29" end="29" resetval="0x0" description="Clear Checksum-error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Checksum-error interrupt level to the INT0 line. This field is writable in LIN mode only." range="29" rwaccess="R/W1TC"/> 
		<bitfield id="CLRISFEINTLVL" width="1" begin="28" end="28" resetval="0x0" description="Clear Inconsistent-Sync-Field-Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Inconsistent-Sync-Field-Error interrupt level to the INT0 line. This field is writable in LIN mode only." range="28" rwaccess="R/W1TC"/> 
		<bitfield id="CLRNREINTLVL" width="1" begin="27" end="27" resetval="0x0" description="Clear No-Reponse-Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the No-Response-Error interrupt level to the INT0 line. This field is writable in LIN mode only." range="27" rwaccess="R/W1TC"/> 
		<bitfield id="CLRFEINTLVL" width="1" begin="26" end="26" resetval="0x0" description="Clear Framing-Error interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Framing-Error interrupt level to the INT0 line." range="26" rwaccess="R/W1TC"/> 
		<bitfield id="CLROEINTLVL" width="1" begin="25" end="25" resetval="0x0" description="Clear Overrun-Error Interrupt Level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Overrun-Error interrupt level to the INT0 line." range="25" rwaccess="R/W1TC"/> 
		<bitfield id="CLRPEINTLVL" width="1" begin="24" end="24" resetval="0x0" description="Clear Parity Error interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Parity Error interrupt level to the INT0 line." range="24" rwaccess="R/W1TC"/> 
		<bitfield id="CLRIDINTLVL" width="1" begin="13" end="13" resetval="0x0" description="Clear ID interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the ID interrupt level to the INT0 line. This field is writable in LIN mode only." range="13" rwaccess="R/W1TC"/> 
		<bitfield id="CLRRXINTLVL" width="1" begin="9" end="9" resetval="0x0" description="Clear Receiver interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the receiver interrupt level to the INT0 line." range="9" rwaccess="R/W1TC"/> 
		<bitfield id="CLRTXINTLVL" width="1" begin="8" end="8" resetval="0x0" description="Clear Transmitter interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the transmitter interrupt level to the INT0 line." range="8" rwaccess="R/W1TC"/> 
		<bitfield id="CLRTOA3WUSINTLVL" width="1" begin="7" end="7" resetval="0x0" description="Clear Timeout After 3 Wakeup Signals interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the timeout after 3 wakeup signals interrupt level to the INT0 line. This field is writable in LIN mode only." range="7" rwaccess="R/W1TC"/> 
		<bitfield id="CLRTOAWUSINTLVL" width="1" begin="6" end="6" resetval="0x0" description="Clear Timeout After Wakeup Signal interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the the timeout after wakeup interrupt level to the INT0 line. This field is writable in LIN mode only." range="6" rwaccess="R/W1TC"/> 
		<bitfield id="CLRTIMEOUTINTLVL" width="1" begin="4" end="4" resetval="0x0" description="Clear Timeout interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the timeout interrupt level to the INT0 line. This field is writable in LIN mode only." range="4" rwaccess="R/W1TC"/> 
		<bitfield id="CLRWAKEUPINTLVL" width="1" begin="1" end="1" resetval="0x0" description="Clear Wake-up interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Wake-up interrupt level to the INT0 line." range="1" rwaccess="R/W1TC"/> 
		<bitfield id="CLRBRKDTINTLVL" width="1" begin="0" end="0" resetval="0x0" description="Clear Break-detect interrupt level.This bit is effective in SCI-compatible mode only. Writing to this bit maps the Break-detect interrupt level to the INT0 line. This field is writable in SCI mode only." range="0" rwaccess="R/W1TC"/>
	</register>
